app/views/notes/show.html.erb

      <ul id="collaborators">
        <% @note.note_collaborators.active.where("email != ?", current_user.email).each do |nc| %>
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 5], ["LIMIT", 1]]