app/assets/javascripts/channels/notes.js.erb

SELECT "notes".* FROM "notes"
---

<% Note.all.each do |note| %>