app/controllers/notes_controller.rb

  def set_note
    @note = current_user.notes.find_by(id: params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 4], ["LIMIT", 1]]