app/controllers/notes_controller.rb

  def create
    @note = current_user.notes.create(note_params)
---
INSERT INTO "notes" ("title", "body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "dsa"], ["body", "dasdasdas"], ["user_id", 1], ["created_at", "2020-08-13 17:59:45.836239"], ["updated_at", "2020-08-13 17:59:45.836239"]]

  def update
    @note.update(note_params)
---
UPDATE "notes" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "notes"."id" = $4  [["title", "This is a title"], ["body", "This is a body This is a body This is a body"], ["updated_at", "2020-08-13 18:12:32.851844"], ["id", 1]]

  def set_note
    @note = current_user.notes.find_by(id: params[:id])
---
SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = $1 AND "notes"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 4], ["LIMIT", 1]]