app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "joekaldas8@gmail.com"], ["LIMIT", 1]]
---
  def create
    self.resource = User.find_by(email: params[:user][:email])